README.org

#+TITLE:	libgdx-tools-installer
#+AUTHOR:	Jaxson Van Doorn
#+EMAIL:	jaxson.vandoorn@gmail.com
#+OPTIONS:  num:nil

* libgdx-tools-installer
*A simple script to install LibGDX Command Line Tools*

The suite of extremely useful LibGDX tools are hidden behind lots of documentation and long commands.  The ~libgdx-tools-installer~ aliases all these tools and install them, as well as their GUI counterparts.

** Usage
*** Installation
~wget -O - https://raw.githubusercontent.com/woofers/libgdx-tools-installer/master/install.sh | sudo bash~
*** Uninstallation
Run the ~uninstall.sh~ in ~/opt/libgdx-tools~ with ~sudo ./uninstall.sh~.
*** Update
Run the ~update.sh~ in ~/opt/libgdx-tools~ with ~sudo ./update.sh~.
** Acknowledgments
**** *GPL 3.0 2018*, /Jaxson Van Doorn/
