README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">libgdx-tools-installer</a>
<ul>
<li><a href="#sec-1-1">Usage</a>
<ul>
<li><a href="#sec-1-1-1">Installation</a></li>
<li><a href="#sec-1-1-2">Uninstallation</a></li>
<li><a href="#sec-1-1-3">Update</a></li>
</ul>
</li>
<li><a href="#sec-1-2">Acknowledgments</a></li>
</ul>
</li>
</ul>
</div>
</div>


# libgdx-tools-installer<a id="sec-1" name="sec-1"></a>

**A simple script to install LibGDX Command Line Tools**

The suite of extremely useful LibGDX tools are hidden behind lots of documentation and long commands.  The `libgdx-tools-installer` aliases all these tools and install them, as well as their GUI counterparts.

## Usage<a id="sec-1-1" name="sec-1-1"></a>

### Installation<a id="sec-1-1-1" name="sec-1-1-1"></a>

`wget -O - https://raw.githubusercontent.com/woofers/libgdx-tools-installer/master/install.sh | sudo bash`

### Uninstallation<a id="sec-1-1-2" name="sec-1-1-2"></a>

Run the `uninstall.sh` in `/opt/libgdx-tools` with `sudo ./uninstall.sh`.

### Update<a id="sec-1-1-3" name="sec-1-1-3"></a>

Run the `update.sh` in `/opt/libgdx-tools` with `sudo ./update.sh`.

## Acknowledgments<a id="sec-1-2" name="sec-1-2"></a>

-   **GPL 3.0 2018**, *Jaxson Van Doorn*
